hlyi/free-dap/platform/samd21/main.c
  if ( glitch_start && (delta < BUTTON_DEBOUNCE_TIME )) return;

  if ( changed && (!glitch_start)) {
    glitch_start = true;
    return;
  }
  // passed glitch filtering
  glitch_start = false;

  changed = lvl != last_lvl;
  delta = cur_time - last_time;

  if ( changed ) {
    //button toggled
    last_time = cur_time;
    last_lvl = lvl;
    if ( key_state == key_proc_idle ) {
      key_state = key_proc_engaged;
      click_cnt = 0;
      return;
    }
    if ( key_state == key_proc_wait_rel) {
      key_state = key_proc_idle;
      click_cnt = 0;
      return;
    }
    // process in progress
    if ( lvl ) {
      // button release
      if ( (delta < BUTTON_CLICK_MIN) || (delta > BUTTON_CLICK_MAX) ) {
        // press is too short or too long, terminate current click counting
        key_state = key_proc_idle;
        // if not too short, register the click
        if ( delta > BUTTON_CLICK_MAX) click_cnt ++;
        switch ( click_cnt ) {
          case 0:
            return;
            break;
          case 1:
            button_state = button_click;
            break;
          case 2:
            button_state = button_doubletap;
            break;
          default:
            button_state = button_tripletap;
            break;
        }
      }else {
        click_cnt ++;
        return;
      }
    }else {
      // button press
      if ( delta < BUTTON_CLICK_MAX ) return;
      switch ( click_cnt ) {
        case 0:
          return;
          break;
        case 1:
          button_state = button_click;
          break;
        case 2:
          button_state = button_doubletap;
          break;
        default:
          button_state = button_tripletap;
          break;
      }
      click_cnt = 0;
    }
  }else if ( key_state == key_proc_engaged ){
    // button not change
    if ( delta <  BUTTON_CLICK_MIN) {
      // wait is too short, ignore
      return;
    }
    if ( lvl ) {
      // button has release long enough
      if (delta > BUTTON_CLICK_MAX ) {
        // button release long enough
        switch ( click_cnt ) {
        case 0:
          break;
        case 1:
          button_state = button_click;
          break;
        break;
        case 2:
          button_state = button_doubletap;
          break;
        default:
          button_state = button_tripletap;
          break;
        }
        click_cnt = 0;
        key_state = key_proc_idle;
      } else {
        // still waiting for press again
        return;
      }
    } else {
      if ( delta > BUTTON_HOLD_MIN ) {
        switch ( click_cnt ) {
          case 0:
            button_state = button_hold;
            break;
          case 1:
            button_state = button_tap_hold;
            break;
          default:
            button_state = button_doubletap_hold;
            break;
        }
        click_cnt = 0;
        key_state = key_proc_wait_rel;
      }else{
        // still waiting
        return;
      }
    }
  }

  // processing button click
  if ( button_state != button_idle ) {
#ifdef BUTTON_DEBUG
    for (int i = 0; i < 2; i++){
      message[3-i] = "0123456789ABCDEF"[button_state& 0xf];
      button_state >>= 4;
    }
    message[4] = '\n';
    usb_cdc_send(message,5);
#endif
    switch (button_state ) {
      case button_click:
        ext_power_toggle();
        break;
      case button_doubletap_hold:
        NVIC_SystemReset();
        break;
      default:
        break;
    }
    button_state = button_idle;
  }
}
#endif

#ifdef HAL_CONFIG_ADC_PWRSENSE
static void adc_init(void)
{
  /* Enable the APB clock for the ADC. */
  PM->APBCMASK.reg |= PM_APBCMASK_ADC;

  /* Enable GCLK1 for the ADC */
  GCLK->CLKCTRL.reg = GCLK_CLKCTRL_CLKEN |
                    GCLK_CLKCTRL_GEN(1) |
                    GCLK_CLKCTRL_ID_ADC;

  /* Wait for bus synchronization. */
  while (GCLK->STATUS.bit.SYNCBUSY) {};

  /* read caliberation data */
  uint32_t bias = (*((uint32_t *) ADC_FUSES_BIASCAL_ADDR) & ADC_FUSES_BIASCAL_Msk) >> ADC_FUSES_BIASCAL_Pos;
  uint32_t linearity = (*((uint32_t *) ADC_FUSES_LINEARITY_0_ADDR) & ADC_FUSES_LINEARITY_0_Msk) >> ADC_FUSES_LINEARITY_0_Pos;
  linearity |= ((*((uint32_t *) ADC_FUSES_LINEARITY_1_ADDR) & ADC_FUSES_LINEARITY_1_Msk) >> ADC_FUSES_LINEARITY_1_Pos) << 5;

  /* Wait for bus synchronization. */
  while (ADC->STATUS.bit.SYNCBUSY) {};

  /* Write the calibration data. */
  ADC->CALIB.reg = ADC_CALIB_BIAS_CAL(bias) | ADC_CALIB_LINEARITY_CAL(linearity);
  /* Wait for bus synchronization. */
  while (ADC->STATUS.bit.SYNCBUSY) {};

  /* Use the internal VCC reference. This is 1/2 of what's on VCCA.
     since VCCA is typically 3.3v, this is 1.65v.
  */
  ADC->REFCTRL.reg = ADC_REFCTRL_REFSEL_INTVCC1;

  /* Only capture four samples for better accuracy,
  */
  ADC->AVGCTRL.reg = ADC_AVGCTRL_SAMPLENUM_8;

  /* Set the clock prescaler to 128, which will run the ADC at
     8 Mhz / 128 = 62.5 kHz.
     Set the resolution to 16bit.
  */
  ADC->CTRLB.reg = ADC_CTRLB_PRESCALER_DIV128 |
                 ADC_CTRLB_RESSEL_16BIT;

  /* Configure the input parameters.

   - GAIN_DIV2 means that the input voltage is halved. This is important
     because the voltage reference is 1/2 of VCCA. So if you want to
     measure 0-3.3v, you need to halve the input as well.

   - MUXNEG_GND means that the ADC should compare the input value to GND.

   - MUXPOST_PIN0 means that the ADC should read from AIN0, or PA02.
  */
  ADC->INPUTCTRL.reg = ADC_INPUTCTRL_GAIN_DIV2 |
                     ADC_INPUTCTRL_MUXNEG_GND |
                     ADC_INPUTCTRL_MUXPOS_PIN0;

  HAL_GPIO_ADC_PWRSENSE_in();
  HAL_GPIO_ADC_PWRSENSE_pmuxen( HAL_GPIO_PMUX_B );
  HAL_GPIO_ADC_VREF_in();
  HAL_GPIO_ADC_VREF_pmuxen( HAL_GPIO_PMUX_B );

  /* Wait for bus synchronization. */
  while (ADC->STATUS.bit.SYNCBUSY) {};

  /* Enable the ADC. */
  ADC->CTRLA.bit.ENABLE = true;
}

static void adc_task(void)
{
#ifdef ADC_DEBUG
  static alignas(4) uint8_t  message[12] = {'V','=', 0,0,0,0,0,0,0,0, '\n',0};
#endif
  enum adc_state { adc_state_idle, adc_state_sync, adc_state_sample };
  static enum adc_state adc_st = adc_state_idle;
  static uint64_t next_sample_time = ADC_SAMPLE_INTERVAL;
  static uint8_t flash_cnt = 0;

  if ( app_system_time < next_sample_time ) return;

  switch (adc_st ){
    case adc_state_idle:
    case adc_state_sync:
      if ( ! ADC->STATUS.bit.SYNCBUSY ) {
        /* Start the ADC using a software trigger. */
        ADC->SWTRIG.bit.START = true;
        adc_st = adc_state_sample;
      }else{
        adc_st = adc_state_sync;
      }
      break;
    case (adc_state_sample ):
      /* check if the result is ready */
      if (ADC->INTFLAG.bit.RESRDY ) {
        /* Clear the flag. */
        ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
        /* Read the value: voltage in uV = result*148  */
        /* Due to onboard resistor dividor 100/147 */
        /* (4095*8) = 3.3V */
        voltage_readout = ADC->RESULT.reg;
        adc_st = adc_state_idle;
        next_sample_time = app_system_time + ADC_SAMPLE_INTERVAL;
#ifdef ADC_DEBUG
        uint32_t result = voltage_readout;
        for (int i = 0; i < 8; i++){
          message[9-i] = "0123456789ABCDEF"[result & 0xf];
          result >>= 4;
        }
        usb_cdc_send(message,11);
#endif
        bool pwr_led_on = false;
        if ( voltage_readout > POWER_DETECT_THRESHOLD ){
          // power detected
          if ( HAL_GPIO_EXT_PWR_read() ) {
             // probe doesn't provide power interface
             // blinking LED
             pwr_led_on = flash_cnt > 1;
             flash_cnt++;
             if ( flash_cnt > 19 ) flash_cnt = 0;
          }else{
             // probe provides power supply, turn on LED
             pwr_led_on = true;
          }
        }
#ifdef HAL_CONFIG_ENABLE_PWR_LED
        TCC0->CC[POWER_LED_CC_CH].reg = pwr_led_on ? LED_BRIGHTNESS : 0 ;
#endif

