hlyi/free-dap/platform/samd21/main.c
      }
      break;
    default:
      // should not be here
        adc_st = adc_state_idle;
        next_sample_time = app_system_time + ADC_SAMPLE_INTERVAL;
     break;
  }
}

#endif


#ifdef HAL_CONFIG_ENABLE_LED_PWMMODE
static void led_custom_init()
{
  /* Enable the APB clock for TCC0 */
  PM->APBCMASK.reg |= PM_APBCMASK_TCC0;
  /* Enable GCLK1 and wire it up to TCC0 and TCC1. */
  GCLK->CLKCTRL.reg = GCLK_CLKCTRL_CLKEN |GCLK_CLKCTRL_ID_TCC0_TCC1 |
                    GCLK_CLKCTRL_GEN(1);
  /* Wait until the clock bus is synchronized. */
  while (GCLK->STATUS.bit.SYNCBUSY) {};

  /* Configure the clock prescaler for each TCC.
     This lets you divide up the clocks frequency to make the TCC count slower
     than the clock. In this case, 8MHz clock by 16 making the
     TCC operate at 500kHz. This means each count (or "tick") is 2us.
  */
  TCC0->CTRLA.reg |= TCC_CTRLA_PRESCALER(TCC_CTRLA_PRESCALER_DIV16_Val);

  TCC0->PER.reg = PWM_LED_PERIOD;
  while (TCC0->SYNCBUSY.bit.PER) {};

  /* Use "Normal PWM" */
  TCC0->WAVE.reg = TCC_WAVE_WAVEGEN_NPWM;
  /* Wait for bus synchronization */
  while (TCC0->SYNCBUSY.bit.WAVE) {};

  /* n for CC[n] is determined by n = x % 4 where x is from WO[x]
   WO[x] comes from the peripheral multiplexer - we'll get to that in a second.
  */
  TCC0->CC[DAP_STATUS_CC_CH].reg = LED_BRIGHTNESS ;
  while (TCC0->SYNCBUSY.bit.CC3) {};

#ifdef HAL_CONFIG_ENABLE_VCP
  TCC0->CC[VCP_STATUS_CC_CH].reg = LED_BRIGHTNESS ;
  while (TCC0->SYNCBUSY.bit.CC2) {};
#endif

#ifdef HAL_CONFIG_ENABLE_PWR_LED
  TCC0->CC[POWER_LED_CC_CH].reg = LED_BRIGHTNESS ;
  while (TCC0->SYNCBUSY.bit.CC0) {};
#endif

  TCC0->CTRLA.reg |= (TCC_CTRLA_ENABLE);
  while (TCC0->SYNCBUSY.bit.ENABLE) {};

  HAL_GPIO_DAP_STATUS_pmuxen( HAL_GPIO_PMUX_F );
  HAL_GPIO_DAP_STATUS_clr();

#ifdef HAL_CONFIG_ENABLE_VCP
  /* set alt func */
  HAL_GPIO_VCP_STATUS_out();
  HAL_GPIO_VCP_STATUS_clr();
  HAL_GPIO_VCP_STATUS_pmuxen( HAL_GPIO_PMUX_F );
#endif

#ifdef HAL_CONFIG_ENABLE_PWR_LED
  /* set alt func */
  HAL_GPIO_PWR_STATUS_out();
  HAL_GPIO_PWR_STATUS_clr();
  HAL_GPIO_PWR_STATUS_pmuxen( HAL_GPIO_PMUX_F );
#endif

}

void custom_hal_gpio_dap_status_toggle()
{
  static int last_value = 0;
  last_value = ! last_value;
  TCC0->CC[DAP_STATUS_CC_CH].reg = last_value ? LED_BRIGHTNESS : 0 ;
}
void custom_hal_gpio_dap_status_set()
{
  TCC0->CC[DAP_STATUS_CC_CH].reg = LED_BRIGHTNESS ;
}

#ifdef HAL_CONFIG_ENABLE_VCP
void custom_hal_gpio_vcp_status_toggle()
{
  static int last_value = 0;
  last_value = ! last_value;
  custom_hal_gpio_vcp_status_write(last_value);
}

void custom_hal_gpio_vcp_status_write(int val)
{
  TCC0->CC[VCP_STATUS_CC_CH].reg = val ? LED_BRIGHTNESS : 0 ;
}

#endif

#ifdef HAL_CONFIG_ENABLE_PWR_LED
void custom_hal_gpio_pwr_status_set()
{
  TCC0->CC[POWER_LED_CC_CH].reg = LED_BRIGHTNESS ;
}
#endif

#endif

static void custom_init(void)
{
#ifdef HAL_CONFIG_ENABLE_LED_PWMMODE
  led_custom_init();
#endif

#ifdef HAL_CONFIG_ENABLE_PWR_LED
  HAL_GPIO_PWR_STATUS_out();
#ifdef HAL_CONFIG_ENABLE_LED_PWMMODE
  custom_hal_gpio_pwr_status_set();
#else
  HAL_GPIO_PWR_STATUS_set();
#endif
#endif

#ifdef HAL_CONFIG_ADC_PWRSENSE
  adc_init();
#endif

#ifdef HAL_CONFIG_ENABLE_PROVIDE_PWR
  HAL_GPIO_EXT_PWR_out();
  HAL_GPIO_EXT_PWR_set();
  pwr_custom_init();
#endif
#ifdef HAL_CONFIG_ENABLE_USB_VEN
  usb_setup_recv(usb_ven_setup_callback);
#endif
}

static void sys_init(void)
{
  uint32_t coarse, fine;

  NVMCTRL->CTRLB.reg = NVMCTRL_CTRLB_RWS(1);

  SYSCTRL->INTFLAG.reg = SYSCTRL_INTFLAG_BOD33RDY | SYSCTRL_INTFLAG_BOD33DET |
      SYSCTRL_INTFLAG_DFLLRDY;

  coarse = NVM_READ_CAL(NVM_DFLL48M_COARSE_CAL);
  fine = NVM_READ_CAL(NVM_DFLL48M_FINE_CAL);

  SYSCTRL->DFLLCTRL.reg = 0; // See Errata 9905
  while (0 == (SYSCTRL->PCLKSR.reg & SYSCTRL_PCLKSR_DFLLRDY));

  SYSCTRL->DFLLMUL.reg = SYSCTRL_DFLLMUL_MUL(48000);
  SYSCTRL->DFLLVAL.reg = SYSCTRL_DFLLVAL_COARSE(coarse) | SYSCTRL_DFLLVAL_FINE(fine);

  SYSCTRL->DFLLCTRL.reg = SYSCTRL_DFLLCTRL_ENABLE | SYSCTRL_DFLLCTRL_USBCRM |
      SYSCTRL_DFLLCTRL_MODE | SYSCTRL_DFLLCTRL_CCDIS;

  while (0 == (SYSCTRL->PCLKSR.reg & SYSCTRL_PCLKSR_DFLLRDY));

  GCLK->GENCTRL.reg = GCLK_GENCTRL_ID(0) | GCLK_GENCTRL_SRC(GCLK_SOURCE_DFLL48M) |
      GCLK_GENCTRL_RUNSTDBY | GCLK_GENCTRL_GENEN;
  while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY);

#if (defined (HAL_CONFIG_ENABLE_LED_PWMMODE) || defined (HAL_CONFIG_ADC_PWRSENSE))
  // enable GCLK1 for peripherals, base clock is 8MHz same as OSC8M but has
  // better accuracy when USB connected
  GCLK->GENCTRL.reg = GCLK_GENCTRL_ID(1) | GCLK_GENCTRL_SRC(GCLK_SOURCE_DFLL48M) |
      GCLK_GENCTRL_RUNSTDBY | GCLK_GENCTRL_GENEN;
  while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY);
  GCLK->GENDIV.reg = GCLK_GENDIV_ID(1) | GCLK_GENDIV_DIV(6);
  while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY);

  custom_init();
#endif

}

//-----------------------------------------------------------------------------
static void serial_number_init(void)
{
  uint32_t wuid[4];
  uint8_t *uid = (uint8_t *)wuid;
  uint32_t sn = 5381;

  wuid[0] = *(volatile uint32_t *)0x0080a00c;
  wuid[1] = *(volatile uint32_t *)0x0080a040;
  wuid[2] = *(volatile uint32_t *)0x0080a044;
  wuid[3] = *(volatile uint32_t *)0x0080a048;

  for (int i = 0; i < 16; i++)
    sn = ((sn << 5) + sn) ^ uid[i];

  for (int i = 0; i < 8; i++)
    usb_serial_number[i] = "0123456789ABCDEF"[(sn >> (i * 4)) & 0xf];

  usb_serial_number[8] = 0;
}

//-----------------------------------------------------------------------------
static void sys_time_init(void)
{
  SysTick->VAL  = 0;
  SysTick->LOAD = F_CPU / 1000ul;
  SysTick->CTRL = SysTick_CTRL_ENABLE_Msk;
  app_system_time = 0;
}

//-----------------------------------------------------------------------------
static void sys_time_task(void)
{
  if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk)
    app_system_time++;
}

#ifdef HAL_CONFIG_ENABLE_VCP
//-----------------------------------------------------------------------------
static void tx_task(void)
{
  while (app_recv_buffer_size)
  {
    if (!uart_write_byte(app_recv_buffer[app_recv_buffer_ptr]))
      break;

